# Полностью задание не выполнил так как не разобрался с темой

# Задание 5 (на генераторы списков и словарей – тема на самостоятельное изучение)
# Создайте список 2 в степени N, где N от 0 до 20.

# numbers = [2**n for n in range(0, 20)]
# print(numbers)

# У вас есть список целых чисел. Создайте новый список остатков от деления на 3 чисел из исходного списка.
# s = [1, 2, 4, 66, 44, 52, 12, 165, 32, 98, 5, 87, 69, 43, 29]
# a = [i % 3 for i in s]
# print(a)

# У вас есть список, в котором могут быть разные типы данных. Создайте новый список только чисел из этого списка.

# pack = ["vasya", "Sasha", "ol3ena", "1243235345", "KOL434344343YA"]
# for i in pack:
#     a = []
#     if i :
#         a += i
#     else:
#         print(pack)
#     print(a)


# pack = [name.title() for name in pack if name.isnumeric([])]
# pack.sort()
# print(pack)


