# # Напишите счетчик с помощью конструкции while, который выводит числа от 0 до 10
# a = 1
# while a <=10:
#     print(a)
#     a = a + 1
# # Напишите счетчик с помощью конструкции while, который выводит числа от 20 до 1
# b = 20
# while b >=1:
#     print(b, end=" ")
#     b = b - 1

# Напишите цикл while, в котором вы, если число чётное, каждую итерацию уменьшаете его в 2 раза.
# Вы делите целое чётное число на 2 пока от него не останется нечётный остаток.
# Посчитайте сколько раз вы делили нацело на 2.
# c = int(input())
# count = 0
# while c != 0:
#     c = c // 2
#     count = count + 1
# print(count)





